# =============================================================================
#                              BREWFILE
# =============================================================================
# Install everything: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# =============================================================================
# CLI Tools
# =============================================================================
brew "git"                  # Version control
brew "gh"                   # GitHub CLI
brew "neovim"               # Modern vim
brew "starship"             # Cross-shell prompt
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast search (rg)
brew "fd"                   # Fast find alternative
brew "bat"                  # Better cat with syntax highlighting
brew "eza"                  # Modern ls replacement
brew "zoxide"               # Smarter cd command
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "htop"                 # Process viewer
brew "tree"                 # Directory tree
brew "wget"                 # Download utility
brew "curl"                 # Transfer data
brew "httpie"               # HTTP client
brew "tldr"                 # Simplified man pages
brew "git-delta"            # Better git diff

# Development
brew "node"                 # Node.js
brew "python"               # Python
brew "go"                   # Go language
brew "rust"                 # Rust language

# Docker & Kubernetes
brew "docker"               # Containers
brew "docker-compose"       # Multi-container apps
brew "kubectl"              # Kubernetes CLI
brew "kubectx"              # Switch k8s contexts

# Infrastructure
brew "terraform"            # Infrastructure as code
brew "awscli"               # AWS CLI

# =============================================================================
# Applications (Casks)
# =============================================================================
cask "visual-studio-code"   # Code editor
cask "iterm2"               # Terminal emulator
cask "raycast"              # Spotlight replacement
cask "arc"                  # Browser
cask "notion"               # Notes & docs
cask "slack"                # Team communication
cask "discord"              # Community chat
cask "spotify"              # Music
cask "1password"            # Password manager
cask "rectangle"            # Window management
cask "obsidian"             # Knowledge base
cask "figma"                # Design tool
cask "docker"               # Docker Desktop

# =============================================================================
# Fonts
# =============================================================================
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# =============================================================================
# Mac App Store (requires 'mas' CLI)
# =============================================================================
# brew "mas"
# mas "Xcode", id: 497799835
# mas "Magnet", id: 441258766
